Config/Enums/ВидыМаркируемойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМаркируемойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
					<Comment>Маркировка обуви</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛекарственныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФотоОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Морепродукты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническиеСредстваРеабилитации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИгрыИИгрушкиДляДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РадиоэлектроннаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТитановаяМеталлопродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РастительныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоволокноИОптоволоконнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мясо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтопительныеПриборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бакалея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоныИНоутбуки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабельнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоторныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхВлажные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/CommonModules/ШтрихкодированиеИСПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

//Выделяет из переданного массива штрихкодов упаковок элементы, в составе которых (на любом уровне вложенности, 
//   в т.ч. частично) находится продукция требуемого вида.
//
//Параметры:
//   ШтрихкодыУпаковок - Массив Из СправочникСсылка.ШтрихкодыУпаковокТоваров - проверяемые элементы.
//   ВидыПродукцииИС - Массив Из ПеречислениеСсылка.ВидыПродукцииИС, ПеречислениеСсылка.ВидыПродукцииИС, Неопределено - Вид отбираемой продукции.
Процедура ВыделитьШтрихкодыСодержащиеВидыПродукции(ШтрихкодыУпаковок, ВидыПродукцииИС) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет соответствие штрихкодов данными: Номенклатура, Храктеристика, МаркируемаяПродукция, Коэффициент.
// 
// Параметры:
//  Штрихкоды            - Соответствие - Список штрихкодов.
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке.
Процедура ЗаполнитьИнформациюПоШтрихкодам(Штрихкоды, КэшированныеЗначения) Экспорт
	
	Возврат;
	
КонецПроцедуры

//В процедуре нужно реализовать подготовку данных для дальнейшей обработки штрихкодов.
//
//Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка,
//   ДанныеШтрихкодов - Массив - полученные штрихкоды,
//   ПараметрыЗаполнения - (см. ИнтеграцияИС.ПараметрыЗаполненияТабличнойЧастиТовары).
//   СтруктураДействий - Структура - подготовленные данные.
//
Процедура ПодготовитьДанныеДляОбработкиШтрихкодов(Форма, ДанныеШтрихкодов, ПараметрыЗаполнения, СтруктураДействий) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В процедуре нужно реализовать обработку штрихкодов.
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма для которой будут обработаны введенные штрихкоды.
//   ДанныеДляОбработки - Структура - структура параметров обработки штрихкодов.
//                                    и заполняется данными из формы.
//   КэшированныеЗначения - Структура - кэш формы.
Процедура ОбработатьШтрихкоды(Форма, ДанныеДляОбработки, КэшированныеЗначения) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В процедуре требуется реализовать алгоритм обработки полученных штрихкодов из ТСД.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка,
//  ДанныеДляОбработки - Структура - подготовленные ранее данные для обработки,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
Процедура ОбработатьДанныеИзТСД(Форма, ДанныеДляОбработки, КэшированныеЗначения) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В процедуре необходимо реализовать заполнение таблицы ДанныеПоEAN на основании заполненной колонки ШтрихкодEAN.
//   Ожидаемое поведение:
//    Если для строки информации по штрихкоду выставляется флаг "ТребуетсяОбработкаШтрихкода", строка информации должна
//    быть уникальной для этого штрихкода.
//
// Параметры:
//  ДанныеПоШтрихкодамEAN - ТаблицаЗначений - передается с обязательной колонкой ШтрихкодEAN, возвращает:
//   * Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура.
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - Характеристика.
//   * Серия - ОпределяемыйТип.СерияНоменклатуры - Серия.
//   * Упаковка - ОпределяемыйТип.Упаковка - Упаковка.
//   * ШтрихкодEAN - Строка - Штрихкод.
//   * ПредставлениеНоменклатуры - Строка - Представление номенклатуры.
//   * ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции ИС.
//   * ВидУпаковкиИС - ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки (из коэффициента регистра ОписаниеGTINИС)
//   * МаркируемаяПродукция - Булево - Истина, если продукция является маркируемой.
//   * Количество - Число - количество товара в весовом штрихкоде EAN или коэффициенте упаковки
//   * ТребуетсяОбработкаШтрихкода - Булево - Истина если штрихкод не следует обрабатывать библиотекой
//   * ДанныеШтрихкода - Структура,Неопределено - Результат получения данных по штрихкоду (для обработки вне библиотеки)
//  ПараметрыПоискаРМК - Структура,Неопределено - Параметр поиска по штрихкоду для РМК
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//
Процедура ПриЗаполненииИнформацииПоШтрихкодамEAN(ДанныеПоШтрихкодамEAN, ПараметрыПоискаРМК = Неопределено, ПараметрыСканирования = Неопределено) Экспорт
	
	Для Каждого СтрокаШтрихкод Из ДанныеПоШтрихкодамEAN Цикл 
		СтрокаШтрихкод.Номенклатура = ПараметрыПоискаРМК.Номенклатура;
		СтрокаШтрихкод.Упаковка = ПараметрыПоискаРМК.Упаковка;
		СтрокаШтрихкод.Количество = 1;
		СтрокаШтрихкод.МаркируемаяПродукция = Истина;
		СтрокаШтрихкод.ВидПродукции = ПараметрыПоискаРМК.ВидПродукцииИС;
	КонецЦикла;
	
КонецПроцедуры

// В процедуре необходимо реализовать заполнение таблицы "ОстаткиМаркируемойПродукции" (по данным информационной базы).
//   На основании данных таблицы будет происходить контроль остатков, если в параметрах сканирования свойство
//   "ОперацияКонтроляАкцизныхМарок" будет заполнено значением "Продажа" или "Возврат", а прочий контроль выключен
//     (сейчас это продажа продукции ИС МП с выключенным контролем статусов).
// Первая операция контролю не подлежит (ранее не участвовавший в товародвижении КМ можно и продать, и вернуть).
// Отсутствие переопределения соответствует отсутствию контроля.
// 
// Параметры:
//  ОстаткиМаркируемойПродукции - См. ШтрихкодированиеИС.ИнициализацияТаблицыПроверкиОстатков.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
Процедура ПриОпределенииОстатковМаркируемойПродукции(ОстаткиМаркируемойПродукции, ПараметрыСканирования) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Переопределение заполнения данных штрихкодов по GTIN.
// Необходимо для поддержки розничных решений (не расширенная версия библиотеки)
// для заполнения данных штрихкодов в отсутствие регистра ОписаниеGTINИС
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ОписанияGTIN - Соответствие из КлючИЗначение - найденные GTIN с их описанием:
//    * Ключ - Строка - GTIN элемента
//    * Значение - Структура - описание элемента:
//      ** ВидУпаковки - ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки,
//      ** КоличествоПотребительскихУпаковок - Число - количество потребительских кодов маркировки по GTIN
//         (1 для потребительских, количество вложенных для групповых и логистических).
//  ДанныеПоGTIN - Соответствие из КлючИЗначение:
//		* Ключ - Строка - GTIN
//		* Значение - Структура - элемент данных
Процедура ПриЗаполненииОписанияGTINПоДаннымШтрихкодов(ПараметрыСканирования, ОписанияGTIN, ДанныеПоGTIN) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В процедуре необходимо реализовать заполнение колонки таблицы значений штрихкодами, соответствующми номенклатуре и характеристике.
//
// Параметры:
//  ДанныеПоШтрихкодам - ТаблицаЗначений - содержит колонки:
//   * Номенклатура   - ОпределяемыйТип.Номенклатура               - входящий.
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - входящий.
//   * Штрихкод       - Строка                                     - исходящий.
//  ИмяКолонкиЗаполнения - Строка - Имя колонки таблицы значений, которую требуется заполнить значением штрихкода.
Процедура ЗаполнитьШтрихкоды(ДанныеПоШтрихкодам, ИмяКолонкиЗаполнения = "Штрихкод") Экспорт
	
	Возврат;
	
КонецПроцедуры

// В процедуре нужно реализовать заполнение массива ШтрихкодыУпаковок из данных документа.
// 
// Параметры:
//  Документ - ДокументСсылка - проверяемый документ.
//  ШтрихкодыУпаковок - Массив - Список штрихкодов.
Процедура ЗаполнитьШтрихкодыУпаковокДокумента(Документ, ШтрихкодыУпаковок) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В процедуре нужно реализовать заполнение таблицы данных данными документа основания.
// 
// Параметры:
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
//  ТаблицаДанных - ТаблицаЗначений - Данные из документа основания.
Процедура СформироватьДанныеДокументаОснования(ПараметрыСканирования, ТаблицаДанных) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В процедуре необходимо реализовать обработку данных штрихкода для общей формы. результат обработки штрихкода следует
// вернуть в параметре РезультатОбработки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Общая форма.
//  ДанныеШтрихкода - См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьДанныеШтрихкода.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
//  ВложенныеШтрихкоды - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьДанныеШтрихкода).
//  РезультатОбработки - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьРезультатОбработкиШтрихкода).
Процедура ОбработатьДанныеШтрихкодаДляОбщейФормы(Форма, ДанныеШтрихкода, ПараметрыСканирования, ВложенныеШтрихкоды, РезультатОбработки) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В этой процедуре при необходимости следует реализовать дополнительные проверки на ошибки данных по штрихкодам.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, для которой выполняется обработка штрихкодов.
//  ДанныеПоШтрихкодам - (См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам). 
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
//  ЕстьОшибки - Булево - Истина, если выявлена ошибка.
Процедура ПриПроверкеДанныхПоШтрихкодам(ДанныеПоШтрихкодам, ПараметрыСканирования, ЕстьОшибки) Экспорт
	
	
КонецПроцедуры

// В данной процедуре требуется переопределить текст запроса, определяющий свойства маркируемой продукции.
//   Номенклатура для запроса лежит во временной таблице с именем по-умолчанию "ДанныеШтрихкодовУпаковок" 
//   Ожидаемые колонки временной таблицы "ДанныеШтрихкодовУпаковок":
//    * Номенклатура   - ОпределяемыйТип.Номенклатура.
//    * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры.
//   Ожидаемые действия:
//   * Создание временной таблицы "СвойстваМаркируемойПродукции" с колонками:
//     ** Номенклатура         - ОпределяемыйТип.Номенклатура - из источника.
//     ** Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - из источника.
//     ** МаркируемаяПродукция - Булево - признак маркируемой продукции.
//     ** ВидПродукции         - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции.
//   * Поле "Номенклатура" желательно индексировать.
// Параметры:
//  ТекстЗапросаСвойстваМаркируемойПродукции - Строка - Переопределяемый текст запроса.
//  ТаблицаИсточник - Строка - имя временной таблицы запроса-источника данных.
Процедура ПриОпределенииТекстаЗапросаСвойствМаркируемойПродукции(ТекстЗапросаСвойстваМаркируемойПродукции, ТаблицаИсточник) Экспорт
	
	ТекстЗапросаСвойстваМаркируемойПродукции = "ВЫБРАТЬ
	                                           |	ДанныеШтрихкодовУпаковок.Номенклатура КАК Номенклатура,
	                                           |	МАКСИМУМ(ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции) <> ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ПустаяСсылка) КАК МаркируемаяПродукция,
	                                           |	ВЫБОР
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура = НЕОПРЕДЕЛЕНО
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ЛегкаяПромышленность)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.МолочнаяПродукция)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.КреслаКоляски)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.КреслаКоляски)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.УпакованнаяВода)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.УпакованнаяВода)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.Антисептики)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Антисептики)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.БАДы)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.БАДы)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.СоковаяПродукция)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.СоковаяПродукция)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ВетеринарныеПрепараты)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ВетеринарныеПрепараты)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ТехническиеСредстваРеабилитации)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ТехническиеСредстваРеабилитации)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.МедицинскиеИзделия)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.МедицинскиеИзделия)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.КормаДляЖивотных)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.КормаДляЖивотныхВлажные)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.Бакалея)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Бакалея)
	                                           |	КОНЕЦ КАК ВидПродукции
	                                           |ПОМЕСТИТЬ СвойстваМаркируемойПродукции
	                                           |ИЗ
	                                           |	ТаблицаИсходныхДанных КАК ДанныеШтрихкодовУпаковок
	                                           |
	                                           |СГРУППИРОВАТЬ ПО
	                                           |	ДанныеШтрихкодовУпаковок.Номенклатура,
	                                           |	ВЫБОР
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура = НЕОПРЕДЕЛЕНО
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ЛегкаяПромышленность)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ЛегкаяПромышленность)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.МолочнаяПродукция)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.КреслаКоляски)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.КреслаКоляски)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.УпакованнаяВода)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.УпакованнаяВода)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.Антисептики)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Антисептики)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.БАДы)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.БАДы)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.СоковаяПродукция)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.СоковаяПродукция)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ВетеринарныеПрепараты)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ВетеринарныеПрепараты)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ТехническиеСредстваРеабилитации)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ТехническиеСредстваРеабилитации)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.МедицинскиеИзделия)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.МедицинскиеИзделия)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.КормаДляЖивотных)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.КормаДляЖивотныхВлажные)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия)
	                                           |		КОГДА ДанныеШтрихкодовУпаковок.Номенклатура.ВидМаркируемойПродукции = ЗНАЧЕНИЕ(Перечисление.ВидыМаркируемойПродукции.Бакалея)
	                                           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Бакалея)
	                                           |	КОНЕЦ
	                                           |
	                                           |ИНДЕКСИРОВАТЬ ПО
	                                           |	Номенклатура";
	
	ТекстЗапросаСвойстваМаркируемойПродукции = СтрЗаменить(ТекстЗапросаСвойстваМаркируемойПродукции, "ТаблицаИсходныхДанных", ТаблицаИсточник);
	
КонецПроцедуры

// В данной процедуре требуется переопределить сочетание клавиш для команды "Добавить без маркировки" в форме сканирования.
// 
// Параметры:
//  СочетаниеКлавиш - СочетаниеКлавиш - По умолчанию "Ctr + Z".
Процедура ПриОпределенииСочетанияКлавишДобавитьБезМаркировкиВФормеСканирования(СочетаниеКлавиш) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В случае учета серий в данной процедуре необходимо реализовать заполнение таблицы значений "ДанныеТаблицыТовары", 
//   содержащей (как минимум, без учета необходимости учета специфики в прикладных документах) колонки: 
//     "Номенклатура", "Характеристика", "Серия", "Количество".
// Если заданы параметры сканирования, таблицу необходимо положить во временное хранилище, адрес хранилища
//     - в ПараметрыСканирования.ДанныеТаблицыТовары. Иначе просто заполнить ДанныеТаблицыТовары по шаблону.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, для которой происходит обработка штрихкодов.
//  ДанныеТаблицыТовары - См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализицияТаблицыДанныхДокумента.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования.
//  СтандартнаяОбработка - Булево - признак дальнейшей стандартной обработки события.
Процедура ПриФормированииДанныхТабличнойЧастиТовары(Форма, ДанныеТаблицыТовары, ПараметрыСканирования, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполнение данных по штрихкодам упаковок, сохраненных в прикладном документе.
// Используется для заполнения данными частичного выбытия по штрихкодам упаковок.
// 	
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, для которой происходит обработка штрихкодов.
//  ДанныеПоШтрихкодамУпаковок - Соответствие из КлючИЗначение:
//                               * Ключ     - СправочникСсылка.ШтрихкодыУпаковокТоваров - Штрихкод упаковки.
//                               * Значение - см. ШтрихкодированиеИС.НоваяСтруктураДанныхШтрихкодаУпаковкиДанныхДокумента.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования.
Процедура ПриФормированииДанныхПоШтрихкодамУпаковокДокумента(Форма, ДанныеПоШтрихкодамУпаковок, ПараметрыСканирования) Экспорт
	
	Возврат;
	
КонецПроцедуры

// В данной процедуре необходимо определить модуль для обработки данных штрихкода. По умолчанию обработка будет 
// выполнена в модуле менеджера. Процедура обработки должна называться "ОбработатьДанныеШтрихкода"
// с параметрами: "Форма", "ДанныеШтрихкода", "ПараметрыСканирования", "ВложенныеШтрихкоды".
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма объекта.
// 	МодульДляОбработки - Произвольный - Модуль, в котором будет выполнена обработка.
// 	СтандартнаяОбработка - Булево - Если требуется переопределеить модуль для обработки - требуется установить флаг в Ложь.
Процедура ОпределитьМодульДляОбработкиДанныхШтрихкода(Форма, МодульДляОбработки, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// По таблице с колонками Номенклатура и Характеристика формирует массив GTIN 
//   и соответствие конкретных кодов GTIN номенклатуре/характеристике
// 
// Параметры:
//   ТаблицаПроверки  - ТаблицаЗначений - входящий, проверяемые даннные с колонками
//    * Номенклатура   - ОпределяемыйТип.Номенклатура
//    * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры
//   ПроверяемыеGTIN  - Массив          - исходящий, все GTIN привязанные к одной из строк таблицы
//   СоответствиеGTIN - Соответствие    - исходящий, пара (GTIN - (Номенклатура,Характеристика,Упаковка,Коэффициент))
//   ИспользоватьХарактеристику - Булево - Признак необходимости использования характеристики.
Процедура ЗаполнитьПроверяемыеGTIN(ТаблицаПроверки, ПроверяемыеGTIN, СоответствиеGTIN, ИспользоватьХарактеристику = Истина) Экспорт
	
	Возврат;
	
КонецПроцедуры

// РМК. Определяет наличие в информационной базе хотя бы одной номенклатуры, которая может выбывать частично.
// 
// Параметры:
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам
//  ТребуетсяЧастичноеВыбытие - Булево - Требуется частичное выбытие
Процедура ПриОпределенииНаличияНоменклатурыСЧастичнымВыбытием(ПараметрыСканирования, ТребуетсяЧастичноеВыбытие) Экспорт
	
	Возврат;
	
КонецПроцедуры

// РМК. Определяет значение штрихкода упаковки по строке таблицы данных кодов маркировки для поиска вскрытых потребительских упаковок.
// 
// Параметры:
//  ЗначеничеШтрихкодаУпаковки - ОпределяемыйТип.ШтрихкодУпаковкиИС - выходной параметр. Значение штрихкода упаковки по строке таблицы
//  СтрокаТаблицы - СтрокаТаблицыЗначений - строка данных таблицы данных кодов маркировки
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  СтандартнаяОбработка - Булево - если выполнено переопределение, то необходимо установить Ложь, иначе будет использовано поле ШтрихкодУпаковки
Процедура ПриОпределенииЗначенияШтрихкодаУпаковкиПоСтрокеТаблицыДанныхКодовМаркировки(ЗначеничеШтрихкодаУпаковки, СтрокаТаблицы, ПараметрыСканирования, СтандартнаяОбработка) Экспорт

	Возврат;
	
КонецПроцедуры

#КонецОбласти
